In [25]:
# 판다스 주입
import pandas as pd

In [26]:
# 열 선언
menu = pd.Series(['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'])
price = pd.Series([4500, 5000, 5500, 5000, 4000, 5900, 5300])
calory = pd.Series([10, 110, 250, 110, 20, 210, 0])

In [27]:
# 데이터프레임 생성
df1 = pd.DataFrame({
    "메뉴": menu,
    "가격": price,
    "칼로리": calory,
})

In [28]:
# csv파일로 변환
df1.to_csv('../data/ch1-1', index=False)

In [29]:
# csv파일 변수저장
tmp1 = pd.read_csv('../data/ch1-1')

In [30]:
# 데이터 확인 1
tmp1.head() # default: 5개

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

In [31]:
# 데이터 확인 2
tmp1.head(2) # 앞에서 2개

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [32]:
# 데이터 확인 3
tmp1.tail(3) # 뒤에서 3개

      메뉴    가격  칼로리
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [33]:
# 데이터 확인 4
tmp1.sample(4) # 랜덤 4개

      메뉴    가격  칼로리
3   카푸치노  5000  110
6     녹차  5300    0
4  에스프레소  4000   20
1   카페라떼  5000  110

In [34]:
# df 크기
tmp1.shape # (row, col)

(7, 3)

In [35]:
# df 정보
tmp1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [36]:
# 상관관계 확인
tmp1.corr(numeric_only=True) # object 컬럼이 있기 때문에 numeric_only 옵션 적용

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [37]:
# 중복 값이 있는 데이터 생성
df2 = pd.DataFrame({
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S', 'M','S']
})

df2.to_csv('../data/ch1-2', index=False)

tmp2 = pd.read_csv('../data/ch1-2')

tmp2.head()

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S
3    SUV    S
4    SUV    M

In [38]:
# 항목 종류 수
tmp2.nunique()

car     2
size    3
dtype: int64

In [39]:
# 항목 종류
print(
    tmp2['car'].unique(),
	tmp2['size'].unique(),
)

['Sedan' 'SUV'] ['S' 'M' 'L']

In [40]:
# 항목별 개수
print(
    tmp2['car'].value_counts(),
    tmp2['size'].value_counts(),
)

car
Sedan    7
SUV      4
Name: count, dtype: int64 size
S    6
M    4
L    1
Name: count, dtype: int64

In [41]:
# 기초 통계 1
tmp1.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [ ]:
# 기초 통계 2
tmp2.describe()

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [ ]:
# 기초 통계 3
tmp1.describe(include='O') # 문자열만 통계

           메뉴
count       7
unique      7
top     아메리카노
freq        1